In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'name':['miku','rin','lin'],
    'age':[16,15,15],
    'sex':['female','female','male'],
}

### Series

In [3]:
s1 = pd.Series(data['name'])
s1

0    miku
1     rin
2     lin
dtype: object

In [4]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
s1.values

array(['miku', 'rin', 'lin'], dtype=object)

### DataFrame

In [8]:
df1 = pd.DataFrame(data)
df1

   age  name     sex
0   16  miku  female
1   15   rin  female
2   15   lin    male

In [10]:
cou = df1['name']
cou

0    miku
1     rin
2     lin
Name: name, dtype: object

In [11]:
type(cou)

pandas.core.series.Series

In [12]:
df1.iterrows()    # 返回一个生成器,可以得到每一行

In [23]:
for row in df1.iterrows():
    print(row)
    print('-----------------')
    print(row[0])
    print(type(row[0]))
    print('-----------------')
    print(row[1])
    print(type(row[1]))
    break

(0, age         16
name      miku
sex     female
Name: 0, dtype: object)
-----------------
0
<class 'int'>
-----------------
age         16
name      miku
sex     female
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

### 通过series创建DataFrame

In [24]:
s1 = pd.Series(data['age'])
s2 = pd.Series(data['name'])
s3 = pd.Series(data['sex'])

In [29]:
df_new = pd.DataFrame([s2,s1,s3], index=['name','age','sex']).T

In [26]:
df_new

  age  name     sex
0  16  miku  female
1  15   rin  female
2  15   lin    male

In [30]:
df1

   age  name     sex
0   16  miku  female
1   15   rin  female
2   15   lin    male